{
  "sender": "york",
  "edition": "Oct22-Oct29",
  "events": [
    {
      "id": 1,
      "name": "Women’s History Month",
      "summary": "Celebrate all the women in your life this October by learning of the accomplishments, difficulties and trials faced by women throughout history.",
      "date": null,
      "time": null,
      "location": null
    },
    {
      "id": 2,
      "name": "Academic Integrity Month",
      "summary": "Partake in workshops, activities and a contest to discover the best ways to uphold academic integrity throughout your university career.",
      "date": null,
      "time": null,
      "location": "Virtual and in-person events"
    },
    {
      "id": 3,
      "name": "BioBlitz",
      "summary": "Explore York by cataloguing and geotagging a wide array of plants, animals and insects using the iNaturalist app. Participate for the chance to win a $50 YU-card prize!",
      "date": null,
      "time": null,
      "location": "Keele and Glendon Campus"
    },
    {
      "id": 4,
      "name": "York’s Sustainability Race",
      "summary": "Take part in the Sustainability Race by completing 30 different digital sustainability challenges across York’s campuses.",
      "date": null,
      "time": null,
      "location": "Keele, Glendon and Markham Campus"
    },
    {
      "id": 5,
      "name": "People, Power & Change A conversation with Marshall Ganz",
      "summary": "Attend a book launch to join the discussion surrounding the practice of organizing for democratic renewal.",
      "date": "2023-10-24",
      "time": "10:30 AM - 11:30 AM",
      "location": "N102 Ross Building, Keele Campus"
    },
    {
      "id": 6,
      "name": "York's Fair Trade Fair",
      "summary": "Meet vendors, community members and students at this event designed to promote awareness of fair trade practices and celebrate Fair Trade Canada’s 30th anniversary.",
      "date": "2023-10-24",
      "time": "10:30 AM - 2:30 PM",
      "location": "Vari Hall Rotunda, Keele Campus"
    },
    {
      "id": 7,
      "name": "Campus Tree Planting",
      "summary": "Make a direct impact on your campus by planting a tree. Help improve York’s ecosystem by creating a greener campus and leaving a positive impact.",
      "date": "2023-10-28",
      "time": "12:30 PM - 2:30 PM",
      "location": "Location confirmed upon registration, Keele Campus"
    },
    {
      "id": 8,
      "name": "Campus Tree Planting",
      "summary": "Make a direct impact on your campus by planting a tree. Help improve York’s ecosystem by creating a greener campus and leaving a positive impact.",
      "date": "2023-10-29",
      "time": "10:30 AM - 12:30 PM",
      "location": "Location confirmed upon registration, Glendon Campus"
    },
    {
      "id": 9,
      "name": "Launch of York's Well-being Strategy",
      "summary": "Discover the six dimensions of well-being that informs York's Well-being Strategy and learn about York's commitment to fostering safe, healthy, inclusive and supportive campuses.",
      "date": null,
      "time": null,
      "location": null
    },
    {
      "id": 10,
      "name": "Prioritize your Health and Well-being",
      "summary": "Engage in activities during Fall Well-being Week that will help you embrace all dimensions of well-being. Explore free events held both in-person and online by visiting the Well-being web page.",
      "date": null,
      "time": null,
      "location": "Online and in-person"
    },
    {
      "id": 11,
      "name": "Drop-in Recreational Programming, Group Classes & Seminars",
      "summary": "Maintain your physical health by attending drop-in recreation programs, seminars and classes offered by Athletics and Recreation.",
      "date": null,
      "time": null,
      "location": null
    },
    {
      "id": 12,
      "name": "Pop-up Advising Fair",
      "summary": "Connect with academic advising experts to get answers to your university related questions, including OSAP, study permits, degree requirements and more.",
      "date": "2023-10-23",
      "time": "10:00 AM - 3:00 PM",
      "location": "Vari Hall Rotunda, Keele Campus and the Glendon Centre of Excellence, Glendon Campus"
    },
    {
      "id": 13,
      "name": "VIEWING PARTY – Raptors Home Opener",
      "summary": "Celebrate York’s official partnership with the Toronto Raptors by showing your team spirit during their first basketball game of the NBA season. During this event, you can also find out how to win tickets to a future Raptors game!",
      "date": "2023-10-23",
      "time": "7:30 PM",
      "location": "The Break Room, Keele Campus"
    },
    {
      "id": 14,
      "name": "Interview Preparation Webinar",
      "summary": "Nervous for the next steps of the hiring process? Prepare yourself accurately for any job interviews by presenting yourself confidently and your skills concisely.",
      "date": "2023-10-23",
      "time": "10:00 AM - 11:30 AM",
      "location": "Online"
    },
    {
      "id": 15,
      "name": "Resumé & Cover Letter Writing",
      "summary": "Find out how to organize your resumé and accompanying cover letter into a simple but effective document that will impress your future employers.",
      "date": "2023-10-23",
      "time": "2:30 PM - 4:00 PM",
      "location": "203 Bethune College, Keele Campus"
    },
    {
      "id": 16,
      "name": "On the Job Success Webinar",
      "summary": "You’ve got the job, congrats! Now what do you do? Discover the best practices to elevate your work ethic after securing the job.",
      "date": "2023-10-25",
      "time": "2:00 PM - 3:30 PM",
      "location": "Online"
    },
    {
      "id": 17,
      "name": "Mentorship Matters",
      "summary": "Learn how to effectively find mentors that will help you succeed! This workshop will feature Connecting YU, York’s exclusive networking platform. Learn how to expand your professional network, find guidance from experienced alumni and access valuable resources to support your career development.",
      "date": "2023-10-29",
      "time": "12:00 PM - 1:00 PM",
      "location": "Alumni & Career Lounge, York Lanes, Keele Campus"
    },
    {
      "id": 18,
      "name": "Volunteer Fair",
      "summary": "Volunteering is a great way to make connections, engage with different industries you’re passionate about and build career-related skills. Connect with several volunteer organizations to find the best fit for you.",
      "date": "2023-10-30",
      "time": "10:30 AM - 2:30 PM",
      "location": "Vari Hall Rotunda, Keele Campus"
    },
    {
      "id": 19,
      "name": "Note-taking Essentials",
      "summary": "Learn the best note-taking strategies to stay on top of your classes while following along with your professor’s lecture.",
      "date": "2023-10-23",
      "time": "10:00 AM - 11:00 AM",
      "location": "Online"
    },
    {
      "id": 20,
      "name": "Critical Thinking",
      "summary": "Get one step ahead of your courses by learning to think critically and deeply analyze your coursework, environment and academic texts.",
      "date": "2023-10-24",
      "time": "9:30 AM - 10:30 AM",
      "location": "Online"
    },
    {
      "id": 21,
      "name": "Network Visualization in Gephi",
      "summary": "Tired of pie charts and bar graphs? Visualize your data with stunning network graphs using Gephi and express the relationships in your data clearly.",
      "date": "2023-10-24",
      "time": "1:00 PM - 2:30 PM",
      "location": "530 Scott Library, Keele Campus"
    },
    {
      "id": 22,
      "name": "Accessing and Responding to Accommodations",
      "summary": "Review the Ontario Human Rights Code policies on accommodations to begin accessing and responding to your needs and the needs of others.",
      "date": "2023-10-24",
      "time": "1:00 PM - 2:30 PM",
      "location": "Online"
    },
    {
      "id": 23,
      "name": "Study Strategies That Work",
      "summary": "Studying for an exam but still having trouble recalling the info you need to know? Try some study strategies that will work with your personality and help you ace your finals.",
      "date": "2023-10-29",
      "time": "12:30 PM - 1:30 PM",
      "location": "Online"
    },
    {
      "id": 24,
      "name": "Mastering Communication: A Key to Entrepreneurial and Professional Success",
      "summary": "Gain insights on the critical role communication plays in both entrepreneurship and professional development, with a connection to bridging cultural gaps and improving client relationships.",
      "date": "2023-10-29",
      "time": "1:30 PM",
      "location": "Online"
    },
    {
      "id": 25,
      "name": "Establishing Effective Boundaries for Leaders",
      "summary": "There are many steps to becoming a leader, and one of them includes setting boundaries. Discover strategies to become a hospitable and approachable leader while still maintaining clear boundaries with your colleagues.",
      "date": "2023-10-31",
      "time": "12:00 PM - 1:00 PM",
      "location": "Online"
    }
  ]
}